InformationRegisters/ПротоколыРасчетаПартийИСебестоимости.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<InformationRegister>
		<Properties>
			<Name>ПротоколыРасчетаПартийИСебестоимости</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Протокол</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>ДлительностьРасчета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПериодРасчета</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПредставлениеОрганизаций</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВариантРасчета</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыРасчетаПартийИСебестоимости</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>БылиОшибки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОписаниеОшибок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Идентификатор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ПротоколыРасчетаПартийИСебестоимости/Forms/ФормаПросмотраПротоколов/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("АвтоТест") Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Параметры.Период) Тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
	
	МассивПротоколов = Новый Массив;
	ПротоколыРасчета = ПолучитьПротоколыРасчета();
	
	Если ЗначениеЗаполнено(ПротоколыРасчета) Тогда
		
		Для Каждого КлючИЗначение Из ПротоколыРасчета Цикл
			ТекущийПротокол = ПолучитьПротоколРасчета(КлючИЗначение.Ключ, Параметры.Период);
			МассивПротоколов.Добавить(Новый ФиксированнаяСтруктура(ТекущийПротокол));
		КонецЦикла;
		
	КонецЕсли;
	
	ПротоколыДляПросмотра = Новый ФиксированныйМассив(МассивПротоколов);
	
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	Отказ = Истина;
	
	Для Каждого ЭлементКоллекции Из ПротоколыДляПросмотра Цикл
		
		ТекущийПротокол = Новый Структура("Протокол, Заголовок");
		ЗаполнитьЗначенияСвойств(ТекущийПротокол, ЭлементКоллекции);
		
		ТекущийПротокол.Протокол.Показать(ТекущийПротокол.Заголовок);
		
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ПолучитьПротоколыРасчета()
	
	Возврат РегистрыСведений.ОшибкиРасчетаПартийИСебестоимости.ПолучитьПротоколыРасчета(
		Параметры.Период,
		Параметры.МассивОрганизаций);
		
КонецФункции

&НаСервере
// Возвращает протокол расчета.
//
Функция ПолучитьПротоколРасчета(Идентификатор, Период)
	
	Заголовок = РасчетСебестоимостиПротоколРасчета.ЗаголовокПротоколаПриВыводе(Период);
	Протокол  = РегистрыСведений.ПротоколыРасчетаПартийИСебестоимости.ПолучитьТекстПротокола(Идентификатор, , Период);
	
	Возврат Новый Структура("Протокол, Заголовок", Протокол, Заголовок);
	
КонецФункции

#КонецОбласти
